In [190]:
print("Inteligencia artificial")

Inteligencia artificial

In [191]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd     # importa biblioteca pandas

In [193]:
# cria o dicionário
Dicionario ={
    "A":[1, 2, 3, 4],
    "B":[5, 6, 7, 8],
    "C":[9, 10, 11, 12]}
Labels=["1ª linha", "2ª linha", "3ª linha", "4ª linha"]

In [194]:
dados = pd.DataFrame(Dicionario, index= Labels)     # cria o dataframe

In [195]:
dados.head()        # exibe as 4 primeiras linhas da base de dados

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10
3ª linha  3  7  11
4ª linha  4  8  12

In [196]:
dados.head(2)

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10

In [197]:
dados.tail()        # exibe as 4 ultimas linhas do dataframe

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10
3ª linha  3  7  11
4ª linha  4  8  12

In [198]:
dados.describe()        # informações estatisticas dos dados

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [199]:
dados.info()        # descreve informações sobre os dados

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1ª linha to 4ª linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [200]:
dados['D']= dados['B']*dados['C']   # multiplicação de colunas do DF

In [201]:
dados.head()

          A  B   C   D
1ª linha  1  5   9  45
2ª linha  2  6  10  60
3ª linha  3  7  11  77
4ª linha  4  8  12  96

In [202]:
dados.drop('B', axis=1, inplace=True)     # exclui a coluna B
# o inplace permite a exclusão de uma coluna na base de dados 
# original

In [203]:
dados.head()

          A   C   D
1ª linha  1   9  45
2ª linha  2  10  60
3ª linha  3  11  77
4ª linha  4  12  96

In [204]:
dados.loc["3ª linha"]   # localiza uma linha

A     3
C    11
D    77
Name: 3ª linha, dtype: int64

In [205]:
dados.loc[["3ª linha", "2ª linha"], ["A", "C"]]     # localiza mais de uma linha 
# e coluna do dataframe

          A   C
3ª linha  3  11
2ª linha  2  10

In [206]:
dados.iloc[0:2] # iloc é para exibir linhas a partir do indice posição

          A   C   D
1ª linha  1   9  45
2ª linha  2  10  60

In [207]:
dados.iloc[0:2, 0:2]

          A   C
1ª linha  1   9
2ª linha  2  10

In [208]:
dados['A'] > 0      # filtro

1ª linha    True
2ª linha    True
3ª linha    True
4ª linha    True
Name: A, dtype: bool

In [209]:
Filtro = dados['A'] > 0     # armazena o resultado na variável filtro

In [210]:
Filtro

1ª linha    True
2ª linha    True
3ª linha    True
4ª linha    True
Name: A, dtype: bool

In [211]:
dados['Filtro']= Filtro

In [212]:
dados.head()

          A   C   D  Filtro
1ª linha  1   9  45    True
2ª linha  2  10  60    True
3ª linha  3  11  77    True
4ª linha  4  12  96    True

In [213]:
dados[(dados['A'] > 2) & (dados['C'] > 2)]      # filtro na coluna a e c

          A   C   D  Filtro
3ª linha  3  11  77    True
4ª linha  4  12  96    True

In [214]:
dados.reset_index()     # reseta o index

      index  A   C   D  Filtro
0  1ª linha  1   9  45    True
1  2ª linha  2  10  60    True
2  3ª linha  3  11  77    True
3  4ª linha  4  12  96    True

In [215]:
dados.set_index('C')        # altera o index do dataframe

    A   D  Filtro
C
9   1  45    True
10  2  60    True
11  3  77    True
12  4  96    True

In [3]:
Dicionario_1 = {
    'A':[10, 20, 30, 40],
    'B':[50, 60, 70, 80],
    'C':[90, 100, 110, 120],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}
Dicionario_2 = {
    'A':[5, 10, 15, 20],
    'B':[35, 70, 105, 140],
    'C':[100, 200, 300, 400],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}
Dicionario_3 = {
    'A':[-10, -20, -30, -40],
    'B':[25, 50, 75, 100],
    'C':[90, 100, 110, 120],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}
Labels_1=['1ª linha', '2ª linha', '3ª linha', '4ª linha']
Labels_2=['5ª linha', '6ª linha', '7ª linha', '8ª linha']
Labels_3=['9ª linha', '10ª linha', '11ª linha', '12ª linha']

In [4]:
df1 = pd.DataFrame(Dicionario_1, index=Labels_1)
df2 = pd.DataFrame(Dicionario_2, index=Labels_2)
df3 = pd.DataFrame(Dicionario_3, index=Labels_3)

In [ ]:
df_n = pd.merge(df1, df2, how='inner', on='Chaves') # une o dataframe 
# a partir da semelhança das chaves na colunas

df_n.head()

In [ ]:
df_l = pd.merge(df1, df2, how='left', on='Chaves') # une o dataframe 
# a partir da semelhança das chaves na colunas

df_l.head()

In [ ]:
df_r = pd.merge(df1, df2, how='right', on='Chaves') # une o dataframe 
# a partir da semelhança das chaves na colunas

df_r.head()

In [16]:
Dicionario_1 = {
    'A': [10,20,30,40],
    'B': [50,60,70,80],
    'C': [90,100,110,120]
}

Dicionario_3 = {
    'D': [30,20,50,40],
    'E': [1,2,3,4],
    'F': [7,8,9,10]
}

Labels_n = ['1ª linha', '2ª linha', '3ª linha', '4ª linha']

In [17]:
Dataframe1 = pd.DataFrame(Dicionario_1, index=Labels_1)
Dataframe3 = pd.DataFrame(Dicionario_3, index=Labels_1)

In [18]:
Dataframe1.join(Dataframe3) # unifica os dataframes com base no label

           A   B    C   D  E   F
1ª linha  10  50   90  30  1   7
2ª linha  20  60  100  20  2   8
3ª linha  30  70  110  50  3   9
4ª linha  40  80  120  40  4  10